import React from 'react';

export default function Home() {
    return (
        <div className="page-content">
            <h2>정희진 | 개발을 통해 가치를 만드는 백엔드 개발자</h2>
            <p>숲을 보는 개발자가 되고 싶습니다.</p>

            <section className="about-me-section">
                <h3>자기 소개</h3>
                <p>
                    안녕하세요. 무(無)에서 유(有)로 만들어내는 개발 과정에서의 즐거움과 성취감을 좋아하는 신입 백엔드 개발자 정희진입니다.
                    <br/>
                    교내 비즈니스 모델 아이디어 대회에서 2년 연속 수상하는 경험과 이외에도 다양한 수상 경력을 가지고 있습니다.
                    <br/>
                    다양한 팀 프로젝트 참여 및 6개월 간의 인턴십을 통해 개발 역량을 활용한 실무 감각을 성장시키고 협업의 중요성을 배웠습니다.
                    <br/>
                    주 스택은 Java와 Spring 이며, AWS 인프라 환경에서 프로젝트를 직접 운영해본 경험도 가지고 있습니다.
                    <br/>
                    이외에도 React.js를 활용한 간단한 프론트엔드 개발 경험이 있습니다.
                </p>
            </section>

            <section className="problem-solving-section">
                <h3>문제 해결에 강한 성장형 개발자</h3>
                <p>
                    저는 문제 해결을 위해 끊임없는 리서치와 학습을 통해 성장하는 개발자입니다.
                    <br/>
                    인턴십 기간 회사에 필요한 효율적인 서비스를 제공하기 위해 개발 역량을 활용하여 문제 해결 능력을 발휘했습니다.
                    <br/>
                    <strong>화면 녹화 웹 모듈 개발</strong>과 <strong>구글 스프레드시트를 활용한 Mini-CRM 시스템 개발</strong>을 성공적으로 완료하며,
                    새로운 기술을 빠르게 습득하고 실제 비즈니스 문제로 연결시켜 해결하는 실무 역량을 크게 향상시킬 수 있었습니다.
                </p>
            </section>

            <section className="communication-section">
                <h3>성장, 도전, 그리고 소통을 중시하는 개발자</h3>
                <p>
                    새로운 기술과 언어를 배우고 활용하는 것을 좋아하며, 다양한 프로젝트를 통해 꾸준히 실력을 향상시키는 것을 추구합니다.
                    <br/>
                    인턴십 기간 업무를 수행하며 사용자와 직접 소통하며 불편함을 듣고 해결하는 과정에서, 개발자의 이해도와 원활한 커뮤니케이션 능력의 중요성을 깨달았습니다.
                    <br/>
                    제가 경험한 성장, 도전, 소통을 바탕으로 끊임없이 배우며, 실질적인 가치를 제공하는 개발자로 성장 중입니다.
                </p>
            </section>
        </div>
    );
}